.scratch.emacs.d/Emacs.org
* 个人信息
#+begin_src emacs-lisp
(setq bookmark-default-file "~/.dotfiles/custom/emacs/bookmarks-default.el")
(setq custom-theme-directory "~/.dotfiles/custom/emacs/themes/")
(setq user-full-name "Xing Wenju"
      user-mail-address "linuxing3@qq.com")
(setq browse-url-browser-function 'browse-url-chromium)
#+end_src

#+RESULTS:
: ./localelpa/themes/
* 个人键绑定 
All common binds in one file for better migration!!! Powered by =general=

Instead of using =doom= macros like =map!=, which is not very convenient to migrate.

#+begin_src emacs-lisp
  (require 'core-keybinds)
#+end_src

* 软件开发

#+begin_src emacs-lisp :tangle no
(require 'editor+ide)
#+end_src
* 运行时表现

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp

  ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src

